Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/javacvs-omegat.tmx
Source language: en_us
Languages: pt_br

source: -i locale The locale to check (all switches that can be applied to annotate can be specified here as well).
pt_br: -i locale O local à verificar (todas opções que podem ser aplicadas à anotações podem ser especificadas aqui).

source: no files specified
pt_br: sem arquivos especificado

source: illegal state
pt_br: estado ilegal

source: File {0} doesn't have a localized counterpart.
pt_br: Arquivo {0} não tem uma contrapartida localizada

source: File {0}
pt_br: Arquivo {0}

source: Property "{0}" doesn't exist in localized file.
pt_br: Propriedade "{0}" não existe no arquivo localizado.

source: Property "{0}" was updated in the original file.
pt_br: Propriedade "{0}" foi atualizada no arquivo original.

source: Property "{0}" was removed from original file.
pt_br: Propriedade "{0}" foi removida do arquivo original.

source: log [-lRbhtN] [-d <dates>] [-r <revisions>] [-s <states>] [-w[logins]] [files...]
pt_br: log [-lRbhtN] [-d <datas>] [-r <revisões>] [-s <estados>] [-w[logins]] [arquivos...]

source: Print out history information for files
pt_br: Exibe na tela o histórico de informações dos arquivos

source: -R Only print name of RCS file.
pt_br: -R Exibe apenas o nome do arquivo RCS.

source: -h Only print header.
pt_br: -h Exibe somente o cabeçalho.

source: -t Only print header and descriptive text.
pt_br: -t Exibe somente o cabeçalho e o texto descritivo.

source: -N Do not list tags.
pt_br: -N Não lista as tags.

source: -b Only list revisions on the default branch.
pt_br: -b Lista somente revisões no branch padrão.

source: -r[revisions] Specify revision(s)s to list.
pt_br: -r[revisões] Especifica revisões à lista.

source: -d dates Specify dates (D1<D2 for range, D for latest before).
pt_br: -d datas Especifica datas (D1<D2 para intervalo, D para última anterior).

source: -s states Only list revisions with specified states.
pt_br: -s estados Lista apenas revisões com os estados especificados.

source: -w[logins] Only list revisions checked in by specified logins.
pt_br: -w[usuários] Lista apenas revisões submetidas pelos usuários especificados.

source: rannotate [-lRf] [-r rev|-D date] files...
pt_br: rannotate [-lRf] [-r rev|-D data] arquivos...

source: Show the last revision where each source line in repository was modified.
pt_br: Exibe a última revisão onde cada linha do arquivo de origem no repositório foi modificado.

source: Usage: {0} Like annotate, but acts directly on files in repository, does not operate on check out sources.
pt_br: Utilização: {0} Como anotação, mas age diretamente em arquivos no repositório, não opera em check out de fontes.

source: remove [-lRf] [files...]
pt_br: remove [-lRf] [arquivos...]

source: Remove a file from the repository
pt_br: Exclui um arquivo do repositório

source: -f Delete the file before removing it.
pt_br: -f Exclui o arquivo antes de remove-lo.

source: -l Process this directory only (not recursive).
pt_br: -l Processa somente o diretório (não é recursivo).

source: rlog [-lRbhtN] [-d <dates>] [-r <revisions>] [-s <states>] [-w[logins]] files...
pt_br: rlog [-lRbhtN] [-d <datas>] [-r <revisões>] [-s <estados>] [-w[usuários]] arquivos...

source: Usage: {0} Like log, but acts directly on files in repository, does not operate on check out sources.
pt_br: Utilização: {0} Como log, mas age diretamente em arquivos no repositório, não opera em check out de fontes.

source: status [-lRv] [files...]
pt_br: status [-lRv] [arquivos...]

source: Display status information on checked out files
pt_br: Exibe informações sobre o estado dos arquivos carregados

source: -v Verbose format; includes tag information for the file
pt_br: -v Formato detalhado; inclui informações de marcações para o arquivo

source: tag [-bcdFflR] [-r rev|-D date] tag_name [files...]
pt_br: tag [-bcdFflR] [-r rev|-D data] nome_marcação [arquivos...]

source: Add a symbolic tag to checked out version of files
pt_br: Adiciona uma marcação simbólica às versões dos arquivos carregados

source: -b Make the tag a "branch" tag, allowing concurrent development.
pt_br: -b Faz da marcação uma marcação "branch", permitindo desenvolvimento concorrente.

source: -c Check that working files are unmodified.
pt_br: -c Verifica para que os arquivos locais não estejam modificados.

source: -d Delete the given tag.
pt_br: -d Exclui a marcação informada.

source: -F Move tag if it already exists.
pt_br: -F Move a marcação, caso esta já exista.

source: -r rev Existing revision/tag.
pt_br: -r rev Revisão/marcação existente.

source: -D date Existing date.
pt_br: -D data Data existente.

source: rtag [-abdFflRn] [-r rev|-D date] tag_name [modules...]
pt_br: rtag [-abdFflRn] [-r rev|-D data] nome_marcação [módulos...]

source: update [-APdflRp] [-k kopt] [-r rev|-D date] [-j rev] [-I ign] [-W spec] [files...]
pt_br: update [-APdflRp] [-k kopt] [-r rev|-D data] [-j rev] [-I ign] [-W spec] [arquivos...]

source: Bring working directory in sync with repository
pt_br: Sincroniza o diretório de trabalho com o repositório

source: -C Overwrite locally modified files with clean repository copies.
pt_br: -C Sobrescreve os arquivos locais com uma cópia limpa a partir do repositório.

source: -d Build directories, like checkout does.
pt_br: -d Constrói disretórios, similar ao comportamento do checkout.

source: -p Send updates to standard output (avoids stickiness).
pt_br: -p Envia as atualizações para a saída padrão (evita persistência).

source: -r rev Update using specified revision/tag (is sticky).
pt_br: -r rev Atualiza utilizando a revisão/marcação informada (é fixa).

source: -D date Set date to update from (is sticky).
pt_br: -D data Define a data de partida da ataulização (é fixa).
